import re
from collections import defaultdict
import spacy
import nltk
from nltk.corpus import stopwords
from transformers import AutoTokenizer, AutoModelForSequenceClassification
import torch
#from extract_keywords import extract_keywords_and_phrases_v2  # Импорт функции для извлечения ключевых слов

# Загрузка необходимых ресурсов
nltk.download('punkt')
nltk.download('stopwords')
nlp = spacy.load('ru_core_news_sm')

# Загрузка модели и токенизатора
tokenizer = AutoTokenizer.from_pretrained("symanto/xlm-roberta-base-snli-mnli-anli-xnli")
model = AutoModelForSequenceClassification.from_pretrained("symanto/xlm-roberta-base-snli-mnli-anli-xnli")

# Структура первого уровня УДК с ключевыми словами
udc_tree = {
    '0': {
        "description": "Наука и знание. Организация. Информационные технологии. Информация. Документация. Библиотечное дело. Учреждения. Публикации",
        "keywords": ["наука", "знание", "информация", "документация", "библиотека", "технологии", "данные"],
        "subcategories": {
            '00': {
                "description": "Общие вопросы науки и культуры. Пропедевтика",
                "keywords": ["пропедевтика", "вопросы науки", "вопросы культуры"],
                  "subcategories": {
                    '001': {
                        "description": "Наука и знание в целом. Организация умственного труда",
                        "keywords": ["наука", "знание", "организация труда", "умственный труд", "значение науки", "защита науки"],
                        "subcategories": {
                            '001.1': {
                                "description": "Общее понятие о науке и знании",
                                "keywords": ["понятие о науке", "понятие о знании"],
                                "subcategories": {
                                    '001.10': {
                                        "description": "Общее понятие о науке и знании",
                                        "keywords": ["понятие науки", "понятие знания"],
                                        "subcategories": {
                                            '001.101': {
                                                "description": "Знания",
                                                "keywords": ["знания"]
                                            },
                                            '001.102': {
                                                "description": "Информация",
                                                "keywords": ["информация"]
                                            },
                                            '001.103': {
                                                "description": "Данные",
                                                "keywords": ["данные"],
                                                "subcategories": {
                                                    '001.103.2': {
                                                        "description": "Метаданные",
                                                        "keywords": ["метаданные", "описание данных"]
                                                    }
                                                }
                                            }
                                        }
                                    },
                                    '001.11': {
                                        "description": "Определение понятия. Природа, цель, сущность знания",
                                        "keywords": ["определение знания", "природа знания", "цель знания", "сущность знания"]
                                    },
                                    '001.12': {
                                        "description": "Характер познаваемых объектов. Явления. Факты. Состояние. Обстоятельства",
                                        "keywords": ["характер объектов", "явления", "факты", "состояния", "обстоятельства"],
                                        "subcategories": {
                                            '001.123': {
                                                "description": "Причины и следствия явлений",
                                                "keywords": ["причины явлений", "следствия явлений"]
                                            },
                                            '001.124': {
                                                "description": "Свойства и воздействие явлений",
                                                "keywords": ["свойства явлений", "воздействие явлений"],
                                                "subcategories": {
                                                    '001.124.2': {
                                                        "description": "Полезные, желательные последствия явлений",
                                                        "keywords": ["полезные последствия", "желательные последствия"]
                                                    },
                                                    '001.124.4': {
                                                        "description": "Вредные, нежелательные последствия явлений",
                                                        "keywords": ["вредные последствия", "нежелательные последствия"]
                                                    }
                                                }

                                            },
                                            '001.126': {
                                                "description": "Применение, использование явлений",
                                                "keywords": ["применение явлений", "использование явлений"]
                                            }
                                        }

                                    },
                                    '001.18': {
                                        "description": "Будущее науки. Прогноз. Научное предвидение",
                                        "keywords": ["будущее науки", "научный прогноз", "научное предвидение"]
                                    },
                                    '001.19': {
                                        "description": "Знание и непознанное. Границы знания",
                                        "keywords": ["знание", "непознанное", "границы знания"]
                                    }
                                }
                            },
                            '001.2': {
                                "description": "Взаимосвязь отдельных научных дисциплин",
                                "keywords": ["взаимосвязь наук", "научные дисциплины"]
                            },
                            '001.3': {
                                "description": "Значение науки и знаний в целом. Ценность, использование, место в обществе. Защита науки",
                                "keywords": ["значение науки", "ценность знаний", "использование знаний", "защита науки"],
                                "subcategories": {
                                    '001.31': {
                                        "description": "Прогресс, продвижение науки и знаний в целом",
                                        "keywords": ["прогресс науки", "продвижение знаний", "развитие науки"]
                                    },
                                    '001.32': {
                                        "description": "Ученые, научные общества. Академии",
                                        "keywords": ["ученые", "научные общества", "академии", "сообщества ученых"],
                                        "subcategories": {
                                            '001.32(450)': {
                                                "description": "Научные общества Италии",
                                                "keywords": ["научные общества Италии", "академии Италии", "ученые Италии"]
                                            }
                                        }
                                    },
                                    '001.35': {
                                        "description": "Критика науки. Неодобрение науки",
                                        "keywords": ["критика науки", "неодобрение науки", "противостояние науке"]
                                    },
                                    '001.38': {
                                        "description": "Поощрение науки. Содействие развитию науки",
                                        "keywords": ["поощрение науки", "содействие науке", "поддержка науки", "развитие науки"]
                                    }
                                }
                            },
                            '001.4': {
                                "description": "Язык науки. Научная терминология. Номенклатура",
                                "keywords": ["язык науки", "научная терминология", "номенклатура"],
                                "subcategories": {
                                    '001.4:81': {
                                        "description": "Языки науки - Языкознание",
                                        "keywords": ["языки науки", "языкознание", "научные языки"]
                                    }
                                }
                            },
                            '001.5': {
                                "description": "Научные теории, гипотезы и системы. Установление зависимости между научными фактами",
                                "keywords": ["научные теории", "гипотезы", "зависимости", "научные факты"],
                                "subcategories": {
                                    '001.51': {
                                        "description": "Методы построения системы",
                                        "keywords": ["методы построения", "системы", "структура"]
                                    },
                                    '001.53': {
                                        "description": "Сравнение. Сопоставление",
                                        "keywords": ["сравнение", "сопоставление", "анализ различий"]
                                    }
                                }

                            },
                            '001.6': {
                                "description": "Научные законы. Исключения из законов",
                                "keywords": ["научные законы", "исключения"],
                                "subcategories": {
                                    '001.61': {
                                        "description": "Способ выражения законов. Статичные и динамичные законы. Представление их в графической форме",
                                        "keywords": ["выражение законов", "статичные законы", "динамичные законы", "графическое представление"]
                                    }
                                }
                            },
                            '001.8': {
                                "description": "Общая методология. Научные и технические методы исследований, изучения, поисков и дискуссий. Научный анализ и синтез",
                                "keywords": ["методология", "научные методы", "технические методы", "научный анализ", "синтез"],
                                "subcategories": {
                                    '001.81': {
                                        "description": "Организация умственного труда",
                                        "keywords": ["организация труда", "умственный труд"],
                                        "subcategories": {
                                            '001.811': {
                                                "description": "Общие правила цитирования, использования и оформления библиографических ссылок",
                                                "keywords": ["цитирование", "библиографические ссылки", "оформление"]
                                            },
                                            '001.812': {
                                                "description": "Средства для работы",
                                                "keywords": ["средства работы", "инструменты"]
                                            },
                                            '001.813': {
                                                "description": "Собирание газетных и прочих вырезок",
                                                "keywords": ["газетные вырезки", "сбор информации"]
                                            },
                                            '001.814': {
                                                "description": "Подбор справочных источников. Изучение содержаний, аннотаций, выдержек, резюме, первых набросков, литературных черновиков",
                                                "keywords": ["справочные источники", "изучение содержаний", "аннотации"],
                                                "subcategories": {
                                                    '001.814.2': {
                                                        "description": "Разыскание источников",
                                                        "keywords": ["разыскание источников", "поиск информации"],
                                                        "subcategories": {
                                                            '001.814.2:002': {
                                                                "description": "Разыскание литературы",
                                                                "keywords": ["разыскание литературы", "поиск литературы"]
                                                            },
                                                            '001.814.2:347.771': {
                                                                "description": "Разыскание патентов",
                                                                "keywords": ["разыскание патентов", "поиск патентов"]
                                                            }
                                                        }

                                                    },
                                                    '001.814.4': {
                                                        "description": "Собирание заметок, выдержек из источников",
                                                        "keywords": ["собирание заметок", "выдержки"]
                                                    },
                                                    '001.814::002': {
                                                        "description": "Разыскание литературы",
                                                        "keywords": ["разыскание литературы", "поиск литературы"]
                                                    }
                                                }

                                            },
                                            '001.815': {
                                                "description": "Составление указателей. Составление именного, предметного указателя",
                                                "keywords": ["указатели", "именной указатель", "предметный указатель"]
                                            },
                                            '001.816': {
                                                "description": "Работа над произведениями, предназначенными для опубликования. Указания автора наборщику или типографскому работнику, касающиеся рукописи и корректуры",
                                                "keywords": ["работа над произведениями", "указания автору"]
                                            },
                                            '001.817': {
                                                "description": "Подготовка докладов. Оформление докладов",
                                                "keywords": ["подготовка докладов", "оформление"]
                                            },
                                            '001.818': {
                                                "description": "Изложение результатов работы. Составление отчетов. Техника отчетности",
                                                "keywords": ["изложение результатов", "составление отчетов", "техника отчетности"]
                                            }
                                        }

                                    },
                                    '001.82': {
                                        "description": "Изучение организации. Методология. Анализ. Синтез. Классификация. Систематизация",
                                        "keywords": ["методология", "анализ", "синтез", "классификация", "систематизация"]
                                    },
                                    '001.83': {
                                        "description": "Научное сотрудничество. Обмен идеями",
                                        "keywords": ["научное сотрудничество", "обмен идеями"],
                                        "subcategories": {
                                            '001.83(100)': {
                                                "description": "Международное научное сотрудничество",
                                                "keywords": ["международное сотрудничество", "научное сотрудничество"]
                                            }
                                        }

                                    },
                                    '001.85': {
                                        "description": "Научная критика",
                                        "keywords": ["научная критика"]
                                    },
                                    '001.86': {
                                        "description": "Конкорданции",
                                        "keywords": ["конкорданции"]
                                    },
                                    '001.87': {
                                        "description": "Учебные наборные кассы (в качестве темы, как их делать и как ими пользоваться)",
                                        "keywords": ["наборные кассы", "учебные пособия"]
                                    },
                                    '001.89': {
                                        "description": "Организация науки и научно-исследовательских работ",
                                        "keywords": ["организация науки", "научно-исследовательские работы"],
                                        "subcategories": {
                                            '001.891': {
                                                "description": "Научные исследования. Методы исследований",
                                                "keywords": ["научные исследования", "методы исследований"]
                                            },
                                            '001.892': {
                                                "description": "Развитие научно-исследовательских работ. Организация опытно-конструкторских работ",
                                                "keywords": ["развитие научных работ", "организация опытно-конструкторских работ"]
                                            },
                                            '001.893': {
                                                "description": "Контроль научно-исследовательских работ",
                                                "keywords": ["контроль научных работ"]
                                            },
                                            '001.894': {
                                                "description": "Изобретения и открытия. Техника изобретений. Работа над изобретениями и открытиями до их завершения или готовности к патентованию",
                                                "keywords": ["изобретения", "открытия", "патентование"]
                                            },
                                            '001.895': {
                                                "description": "Нововведения (новшества). Инновации",
                                                "keywords": ["нововведения", "инновации"]
                                            },
                                            '001.89:005.71': {
                                                "description": "Научно-исследовательские учреждения",
                                                "keywords": ["научно-исследовательские учреждения"]
                                            }
                                        }

                                    }
                                }

                            },
                            '001.9': {
                                "description": "Распространение знаний",
                                "keywords": ["распространение знаний"],
                                "subcategories": {
                                    '001.91': {
                                        "description": "Обобщение. Расширение применения",
                                        "keywords": ["обобщение", "расширение применения"]
                                    },
                                    '001.92': {
                                        "description": "Распространение фактически установленных знаний. Популяризация науки",
                                        "keywords": ["распространение знаний", "популяризация науки"],
                                        "subcategories": {
                                            '001.92:37': {
                                                "description": "Наука и образование",
                                                "keywords": ["наука", "образование"]
                                            }
                                        }
                                    },
                                    '001.94': {
                                        "description": "Различные явления, не получившие еще полного научного объяснения",
                                        "keywords": ["неполное научное объяснение", "различные явления"]
                                    },
                                    '001.95': {
                                        "description": "Преднамеренный обман и мистификация в науке",
                                        "keywords": ["обман", "мистификация"]
                                    },
                                    '001.97': {
                                        "description": "Псевдонаучные предсказания, фантазии, например 'лучи смерти'",
                                        "keywords": ["псевдонаучные предсказания", "фантазии"]
                                    },
                                    '001.98': {
                                        "description": "Фальсификация науки. Ошибочные доктрины, заблуждения (из-за недостатка знаний, пристрастия, чрезмерного усердия и т. п.)",
                                        "keywords": ["фальсификация", "ошибочные доктрины"]
                                    },
                                    '001.99': {
                                        "description": "Ограничения в распространении знаний. Нераспространение. Секретность",
                                        "keywords": ["ограничения", "нерасспространение", "секретность"]
                                    },
                                    '001:061.1(100)': {
                                        "description": "Международные организации по научной деятельности",
                                        "keywords": ["международные организации", "научная деятельность"]
                                    }
                                }

                            }
                        }
                    },
                    '002': {
                        "description": "Документация. Научно-техническая информация (НТИ). Печать в целом. Авторство",
                        "keywords": ["документация", "научно-техническая информация", "печать", "авторство"],
                        "subcategories": {
                                '002.1': {
                                    "description": "Документы (носители информации) как объект",
                                    "keywords": ["документы", "носители информации"],
                                    "subcategories": {
                                            '002.1-028.17': {
                                                "description": "Аудио-документы",
                                                "keywords": ["аудио-документы"]
                                            },
                                            '002.1-028.25': {
                                                "description": "Печатные, бумажные документы",
                                                "keywords": ["печать", "бумажные документы"]
                                            }
                                        }
                                },
                                '002.2': {
                                    "description": "Печать в целом: по отдельным лицам, предметам и странам. Книговедение",
                                    "keywords": ["печать", "книговедение"],
                                    "subcategories": {
                                            '002.2(470+571) (083.41)': {
                                                "description": "Статистика печати России",
                                                "keywords": ["статистика", "печать", "Россия"]
                                            }
                                        }
                                },
                                '002.6': {
                                    "description": "Центры документации. Органы научно-технической информации",
                                    "keywords": ["центры документации", "научно-техническая информация"],
                                    "subcategories": {
                                            '002.61': {
                                                "description": "Международные центры документации",
                                                "keywords": ["международные", "центры документации"]
                                            },
                                            '002.63': {
                                                "description": "Национальные общегосударственные и территориальные центры документации. Центральные отраслевые органы научно-технической информации",
                                                "keywords": ["национальные", "центры документации", "отраслевые органы"]
                                            },
                                            '002.66': {
                                                "description": "Центры документации на предприятиях и в учреждениях. Отделы научно-технической информации (ОНТИ)",
                                                "keywords": ["центры документации", "предприятия", "учреждения", "ОНТИ"]
                                            }
                                        }
                                }
                            }
                    },
                    '003': {
                        "description": "Системы письма и письменности. Знаки и символы. Семиотика в целом. Коды. Графическое представление мысли",
                        "keywords": ["системы письма", "знаки", "символы", "семиотика", "коды", "графическое представление"],
                        "subcategories": {
                                '003.0': {
                                    "description": "",  # Пустое описание
                                    "keywords": [],  # Пустые ключевые слова
                                    "subcategories": {
                                        '003.01': {
                                            "description": "Происхождение. Предварительная ступень",
                                            "keywords": ["происхождение", "предварительная ступень"]
                                        },
                                        '003.02': {
                                            "description": "Начало письменности",
                                            "keywords": ["начало письменности"]
                                        },
                                        '003.03': {
                                            "description": "Графическое представление речи",
                                            "keywords": ["графическое представление", "речь"],
                                            "subcategories": {
                                                    '003.031': {
                                                        "description": "Порядок букв или письменных знаков. Перечисление знаков и символов",
                                                        "keywords": ["порядок букв", "письменные знаки", "знаки и символы"]
                                                    },
                                                    '003.032': {
                                                        "description": "Названия букв",
                                                        "keywords": ["названия букв"]
                                                    },
                                                    '003.033': {
                                                        "description": "Конверсия письменных знаков по декрету для местного использования (например, романизация турецкой письменности в 1928г.)",
                                                        "keywords": ["конверсия письменных знаков", "романизация"]
                                                    },
                                                    '003.034': {
                                                        "description": "Транслитерация. Представление графем одной письменности графемами другой письменности",
                                                        "keywords": ["транслитерация", "графемы"]
                                                    },
                                                    '003.035': {
                                                        "description": "Транскрипция. Представление звуков языка-источника графемами другого языка",
                                                        "keywords": ["транскрипция", "звуки языка", "графемы"]
                                                    },
                                                    '003.037': {
                                                        "description": "Орфография. Написание",
                                                        "keywords": ["орфография", "написание"],
                                                        "subcategories": {
                                                                '003.037.2': {
                                                                    "description": "Полнота написания (например, в древнееврейском письме)",
                                                                    "keywords": ["полнота написания", "древнееврейское письмо"],
                                                                    "subcategories": {
                                                                            '003.037.22': {
                                                                                "description": "Полное написание",
                                                                                "keywords": ["полное написание"]
                                                                            },
                                                                            '003.037.24': {
                                                                                "description": "Неполное написание",
                                                                                "keywords": ["неполное написание"]
                                                                            }
                                                                        }
                                                                },
                                                                '003.037.4': {
                                                                    "description": "Знаки огласовки (например, в древнееврейском и арабском письме)",
                                                                    "keywords": ["знаки огласовки", "древнееврейское письмо", "арабское письмо"]
                                                                }
                                                            }
                                                    },
                                                    '003.038': {
                                                        "description": "Приспособление какой-либо письменности к другим языкам и диалектам (например, путем добавления специальных букв, диакритических знаков и т. п.)",
                                                        "keywords": ["приспособление письменности", "языки и диалекты", "диакритические знаки"]
                                                    }
                                                }
                                        },
                                        '003.05': {
                                            "description": "Способы письма в зависимости от средств написания букв и знаков",
                                            "keywords": ["способы письма", "средства написания"],
                                            "subcategories": {
                                                    '003.053': {
                                                        "description": "Написание от руки с использованием письменных принадлежностей",
                                                        "keywords": ["написание от руки", "письменные принадлежности"]
                                                    },
                                                    '003.055': {
                                                        "description": "Написание с помощью печатных машин",
                                                        "keywords": ["печать", "печатные машины"]
                                                    },
                                                    '003.056': {
                                                        "description": "Способы письма с помощью клавиатуры компьютера. Машинопись",
                                                        "keywords": ["машинопись", "клавиатура", "компьютер"]
                                                    },
                                                    '003.057': {
                                                        "description": "Написание с помощью штемпелей и т.п.",
                                                        "keywords": ["штемпели", "методы письма"]
                                                    }
                                                }
                                        },
                                        '003.07': {
                                            "description": "Стили и шрифты письма",
                                            "keywords": ["стили письма", "шрифты"],
                                            "subcategories": {
                                                    '003.071': {
                                                        "description": "Эпиграфический стиль. Надписи. Лапидарный стиль",
                                                        "keywords": ["эпиграфика", "лапидарный стиль", "надписи"]
                                                    },
                                                    '003.072': {
                                                        "description": "Палеографический стиль",
                                                        "keywords": ["палеография", "стили письма"]
                                                    },
                                                    '003.074': {
                                                        "description": "Дипломатический стиль. Официально-деловой стиль",
                                                        "keywords": ["дипломатический стиль", "официальный стиль"]
                                                    },
                                                    '003.075': {
                                                        "description": "Печатные шрифты",
                                                        "keywords": ["печатные шрифты"]
                                                    },
                                                    '003.076': {
                                                        "description": "Рукописные шрифты. Почерки",
                                                        "keywords": ["рукописные шрифты", "почерк"]
                                                    },
                                                    '003.077': {
                                                        "description": "Декоративные, орнаментальные шрифты. Каллиграфия",
                                                        "keywords": ["декоративные шрифты", "каллиграфия", "орнаментальные шрифты"]
                                                    }
                                                }
                                        },
                                        '003.08': {
                                            "description": "Характеристики письма",
                                            "keywords": ["характеристики письма"],
                                            "subcategories": {
                                                    '003.081': {
                                                        "description": "Формообразование. Основные знаки, письменные знаки, буквы",
                                                        "keywords": ["формообразование", "письменные знаки", "буквы"],
                                                        "subcategories": {
                                                                '003.081.1': {
                                                                    "description": "Прописные буквы (маюскулы)",
                                                                    "keywords": ["прописные буквы", "маюскулы"]
                                                                },
                                                                '003.081.3': {
                                                                    "description": "Алфавиты",
                                                                    "keywords": ["алфавиты"]
                                                                },
                                                                '003.081.4': {
                                                                    "description": "Буквы, имеющие необычную форму",
                                                                    "keywords": ["необычные буквы", "формы букв"]
                                                                },
                                                                '003.081.5': {
                                                                    "description": "Сходство знаков",
                                                                    "keywords": ["сходство знаков"]
                                                                },
                                                                '003.081.6': {
                                                                    "description": "Комбинация букв",
                                                                    "keywords": ["комбинация букв"]
                                                                },
                                                                '003.081.7': {
                                                                    "description": "Слияние букв. Лигатуры",
                                                                    "keywords": ["слияние букв", "лигатуры"]
                                                                },
                                                                '003.081.8': {
                                                                    "description": "Буквы или знаки в зависимости от расположения к линии письма",
                                                                    "keywords": ["расположение к линии письма", "буквы", "знаки"],
                                                                    "subcategories": {
                                                                            '003.081.82': {
                                                                                "description": "Надстрочные буквы или знаки",
                                                                                "keywords": ["надстрочные буквы", "знаки"]
                                                                            },
                                                                            '003.081.84': {
                                                                                "description": "Подстрочные буквы или знаки",
                                                                                "keywords": ["подстрочные буквы", "знаки"]
                                                                            }
                                                                        }
                                                                }
                                                            }
                                                    },
                                                    '003.082': {
                                                        "description": "Диакритические знаки. Знаки акцента (ударения)",
                                                        "keywords": ["диакритические знаки", "акцент", "ударение"],
                                                        "subcategories": {
                                                                '003.082.1': {
                                                                    "description": "Непроизносимые знаки, изменяющие произношение букв (например, знаки акцента (ударения), трема, тильда, седиль, точка)",
                                                                    "keywords": ["непроизносимые знаки", "акцент", "трема", "тильда", "седиль", "точка"]
                                                                },
                                                                '003.082.2': {
                                                                    "description": "Гласные знаки, не обозначенные буквами, 'пунктуация' и гласные метки (древнееврейское, арабское письмо и др.)",
                                                                    "keywords": ["гласные знаки", "пунктуация", "гласные метки"]
                                                                },
                                                                '003.082.3': {
                                                                    "description": "Согласные знаки, не обозначенные буквами (например, знаки придыхания в греческом письме)",
                                                                    "keywords": ["согласные знаки", "знаки придыхания"]
                                                                },
                                                                '003.082.4': {
                                                                    "description": "Знаки акцента (ударения). Звуковые акценты (например, в романизированном китайском письме)",
                                                                    "keywords": ["знаки акцента", "звуковые акценты"]
                                                                },
                                                                '003.082.6': {
                                                                    "description": "Просодические знаки",
                                                                    "keywords": ["просодические знаки"]
                                                                }
                                                            }
                                                    },
                                                    '003.083': {
                                                        "description": "Сокращения. Аббревиатуры. Сигла. Аббревиатуры, полученные с помощью апокопы и синкопы. Акронимы",
                                                        "keywords": ["сокращения", "аббревиатуры", "сиглы", "апокопы", "синкопы", "акронимы"]
                                                    },
                                                    '003.084': {
                                                        "description": "Словообразование. Разделение на слоги",
                                                        "keywords": ["словотворение", "разделение на слоги"]
                                                    },
                                                    '003.085': {
                                                        "description": "Образование предложений. Разделение слов",
                                                        "keywords": ["образование предложений", "разделение слов"]
                                                    },
                                                    '003.086': {
                                                        "description": "Знаки препинания. Пунктуация",
                                                        "keywords": ["знаки препинания", "пунктуация"]
                                                    },
                                                    '003.087': {
                                                        "description": "Направление письма",
                                                        "keywords": ["направление письма"],
                                                        "subcategories": {
                                                                '003.087.1': {
                                                                    "description": "слева направо",
                                                                    "keywords": ["слева направо"]
                                                                },
                                                                '003.087.2': {
                                                                    "description": "справа налево",
                                                                    "keywords": ["справа налево"]
                                                                },
                                                                '003.087.3': {
                                                                    "description": "Бустрофедон",
                                                                    "keywords": ["бустрофедон"]
                                                                },
                                                                '003.087.6': {
                                                                    "description": "вертикальное справа налево",
                                                                    "keywords": ["вертикальное справа налево"]
                                                                },
                                                                '003.087.7': {
                                                                    "description": "вертикальное слева направо",
                                                                    "keywords": ["вертикальное слева направо"]
                                                                },
                                                                '003.087.8': {
                                                                    "description": "спиральное, орнаментальное (например, 'ковровый' стиль)",
                                                                    "keywords": ["спиральное", "орнаментальное", "ковровый стиль"]
                                                                },
                                                                '003.087.9': {
                                                                    "description": "Прочие направления письма (например, вверх)",
                                                                    "keywords": ["прочие направления письма", "вверх"]
                                                                }
                                                            }
                                                    },
                                                    '003.088': {
                                                        "description": "Внешние характеристики письма",
                                                        "keywords": ["внешние характеристики", "характеристики письма"],
                                                        "subcategories": {
                                                                '003.088.2': {
                                                                    "description": "Наклон письма",
                                                                    "keywords": ["наклон письма"]
                                                                }
                                                            }
                                                    }
                                                }
                                        },
                                        '003.09': {
                                            "description": "Техника и методы расшифровки письма",
                                            "keywords": ["техника расшифровки", "методы расшифровки"]
                                        }
                                    }

                                },
                                '003.2': {
                                    "description": "Системы письма. Графическое представление мысли",
                                    "keywords": ["системы письма", "графическое представление"],
                                    "subcategories": {
                                            '003.21': {
                                                "description": "Картинное письмо. Пиктография. Логографические системы письма",
                                                "keywords": ["картинное письмо", "пиктография", "логографические системы"],
                                                "subcategories": {
                                                        '003.212': {
                                                            "description": "Пиктографические системы письма. Иероглифы",
                                                            "keywords": ["пиктографические системы", "иероглифы"]
                                                        },
                                                        '003.214': {
                                                            "description": "Логографические системы письма (например, китайская система письма)",
                                                            "keywords": ["логографические системы", "китайская система письма"]
                                                        },
                                                        '003.216': {
                                                            "description": "Логографическо-силлабические письма (например, японская система письма)",
                                                            "keywords": ["логографическо-силлабические письма", "японская система письма"]
                                                        }
                                                    }
                                            },
                                            '003.22': {
                                                "description": "Фонологические системы письма",
                                                "keywords": ["фонологические системы письма"],
                                                "subcategories": {
                                                    '003.22': {
                                                        "description": "Слоговые системы письма. Слоговые азбуки. Ребусное письмо. Фонограммы. Текстовые послания (орфографические аспекты)",
                                                        "keywords": ["слоговые системы", "слоговые азбуки", "ребусное письмо", "фонограммы", "текстовые послания"]
                                                    },
                                                    '003.23': {
                                                        "description": "Алфавитные системы письма",
                                                        "keywords": ["алфавитные системы письма"]
                                                    }
                                                }
                                            },
                                            '003.24': {
                                                "description": "Письмо для слепых. Азбука Брайля",
                                                "keywords": ["письмо для слепых", "азбука Брайля"]
                                            },
                                            '003.26': {
                                                "description": "Криптография. Тайнопись",
                                                "keywords": ["криптография", "тайнопись"],
                                                "subcategories": {
                                                        '003.26.0': {
                                                            "description": "",  # Оставлено пустым
                                                            "keywords": [],
                                                            "subcategories": {
                                                                            '003.26.09': {
                                                                                "description": "Техника и методы расшифровки",
                                                                                "keywords": ["техника расшифровки", "методы расшифровки"]
                                                                            }
                                                                        }
                                                        }
                                                }
                                            },
                                            '003.27': {
                                                "description": "Стенография. Скоростное письмо",
                                                "keywords": ["стенография", "скоростное письмо"]
                                            },
                                            '003.28': {
                                                "description": "Педографические системы. Системы письма для учебных целей. Фонетические системы",
                                                "keywords": ["педографические системы", "системы письма для учебных целей", "фонетические системы"]
                                            },
                                            '003.29': {
                                                "description": "Коды. Технография. Необычные системы письменности",
                                                "keywords": ["коды", "технография", "необычные системы письменности"],
                                                "subcategories": {
                                                        '003.292': {
                                                            "description": "Коды, предназначенные преимущественно для прочтения человеком",
                                                            "keywords": ["коды для человека", "читаемые коды"],
                                                            "subcategories": {
                                                                    '003.292.2': {
                                                                        "description": "Алфавитные, буквенные коды",
                                                                        "keywords": ["алфавитные коды", "буквенные коды"]
                                                                    },
                                                                    '003.292.3': {
                                                                        "description": "Цифровые коды",
                                                                        "keywords": ["цифровые коды"]
                                                                    },
                                                                    '003.292.4': {
                                                                        "description": "Буквенно-цифровые коды",
                                                                        "keywords": ["буквенно-цифровые коды"]
                                                                    },
                                                                    '003.292.5': {
                                                                        "description": "Цветовые коды",
                                                                        "keywords": ["цветовые коды"]
                                                                    },
                                                                    '003.292.6': {
                                                                        "description": "Флажные коды",
                                                                        "keywords": ["флажные коды"]
                                                                    }
                                                                }
                                                        },
                                                        '003.295': {
                                                            "description": "Коды, предназначенные преимущественно для машинного чтения",
                                                            "keywords": ["машинное чтение", "коды для машин"],
                                                            "subcategories": {
                                                                    '003.295.1': {
                                                                        "description": "Азбука Морзе",
                                                                        "keywords": ["азбука Морзе", "морзянка"]
                                                                    },
                                                                    '003.295.4': {
                                                                        "description": "Механически читаемые коды",
                                                                        "keywords": ["механические коды", "механическое чтение"]
                                                                    },
                                                                    '003.295.6': {
                                                                        "description": "Электромагнетически читаемые коды",
                                                                        "keywords": ["электромагнетические коды", "электромагнитное чтение"]
                                                                    },
                                                                    '003.295.8': {
                                                                        "description": "Оптически читаемые коды. Штриховые коды",
                                                                        "keywords": ["оптические коды", "штрих-коды"]
                                                                    }
                                                                }
                                                        }
                                                    }
                                            }
                                        }
                                },
                                '003.3': {
                                    "description": "Письменности",
                                    "keywords": ["письменности", "графика"],
                                    "subcategories": {
                                            '003.31': {
                                                "description": "Предшественники письменности",
                                                "keywords": ["предшественники письменности", "дописьменные системы"],
                                                "subcategories": {
                                                        '003.312': {
                                                            "description": "Искусственные знаки. Зарубки на палочках. Засечки. Резьба. Веревочные узелки. Бусы, пояса из раковин",
                                                            "keywords": ["искусственные знаки", "зарубки", "засечки", "резьба", "узелки", "бусы", "пояса"]
                                                        },
                                                        '003.314': {
                                                            "description": "Пиктографические письмена. Петроглифы (изображения на камне)",
                                                            "keywords": ["пиктография", "петроглифы", "изображения на камне"]
                                                        },
                                                        '003.315': {
                                                            "description": "Доисторические письмена. Несформировавшиеся письмена. Долинейное письмо. Протописьмо",
                                                            "keywords": ["доисторические письмена", "несформировавшиеся письмена", "долинейное письмо", "протописьмо"]
                                                        }
                                                    }
                                            },
                                            '003.32': {
                                                "description": "Идеографические и логографические письменности",
                                                "keywords": ["идеографические системы", "логографические системы"],
                                                "subcategories": {
                                                        '003.321': {
                                                            "description": "Письменности древних культур Америки",
                                                            "keywords": ["письменности древних культур Америки", "майя", "ацтеки", "инки"]
                                                        },
                                                        '003.322': {
                                                            "description": "Древние египетские письменности. Иероглифы. Иератика. Демотика",
                                                            "keywords": ["египетская письменность", "иероглифы", "иератика", "демотика"]
                                                        },
                                                        '003.323': {
                                                            "description": "Клинопись. Шумерская, хеттская клинопись",
                                                            "keywords": ["клинопись", "шумерская письменность", "хеттская письменность"]
                                                        },
                                                        '003.324': {
                                                            "description": "Письменности Восточной Азии",
                                                            "keywords": ["письменности Восточной Азии", "китайская письменность", "японская письменность"],
                                                            "subcategories": {
                                                                    '003.324.1': {
                                                                        "description": "Китайские письменности",
                                                                        "keywords": ["китайская письменность", "иероглифы", "ханьцзы"],
                                                                        "subcategories": {
                                                                                '003.324.1.035:003.349.3': {
                                                                                    "description": "Транскрибирование китайского письма русской кириллицей",
                                                                                    "keywords": ["транскрибирование китайского письма", "транслитерация китайского на кириллицу", "русская кириллица для китайского"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '003.324.2': {
                                                                        "description": "Японские письменности",
                                                                        "keywords": ["японская письменность", "кандзи", "хирагана", "катакана"],
                                                                        "subcategories": {
                                                                                '003.324.21': {
                                                                                    "description": "Древние японские письменности",
                                                                                    "keywords": ["древняя японская письменность", "старояпонская письменность"]
                                                                                },
                                                                                '003.324.22': {
                                                                                    "description": "Хирагана",
                                                                                    "keywords": ["хирагана", "японские слоги", "японский алфавит"]
                                                                                },
                                                                                '003.324.23': {
                                                                                    "description": "Катакана",
                                                                                    "keywords": ["катакана", "японская азбука", "иностранные слова на японском"]
                                                                                },
                                                                                '003.324.25': {
                                                                                    "description": "Кандзи",
                                                                                    "keywords": ["кандзи", "иероглифы", "китайские знаки в японском"]
                                                                                },
                                                                                '003.324.26': {
                                                                                    "description": "Современное \"смешанное письмо\" (кандзи кана мидзири бун)",
                                                                                    "keywords": ["смешанное письмо", "кандзи и кана", "кандзи кана мидзири бун", "современная японская письменность"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '003.324.3': {
                                                                        "description": "Корейская письменность",
                                                                        "keywords": ["корейская письменность", "хангыль", "ханча"]
                                                                    },
                                                                    '003.324.4': {
                                                                        "description": "Вьетнамская письменность",
                                                                        "keywords": ["вьетнамская письменность", "ч Nom", "вьетнамские иероглифы", "quốc ngữ"]
                                                                    },
                                                                    '003.324.6': {
                                                                        "description": "Прочие системы письменности на основе китайской",
                                                                        "keywords": ["письменности на основе китайской", "вьетнамский ч Nom", "иероглифические системы"]
                                                                    }
                                                                }
                                                        },
                                                        '003.326': {
                                                            "description": "Логографические письменности народов Средиземноморья",
                                                            "keywords": ["логографические письменности", "Средиземноморье", "крито-минойская письменность"],
                                                            "subcategories": {
                                                                    '003.326.1': {
                                                                        "description": "Древняя Критская и Минойская письменности",
                                                                        "keywords": ["Критская письменность", "Минойская письменность", "древние письменности Крита"]
                                                                    },
                                                                    '003.326.3': {
                                                                        "description": "Кипрская силлабическая письменность",
                                                                        "keywords": ["Кипрская письменность", "силлабическое письмо", "Кипрский слоговой алфавит"]
                                                                    },
                                                                    '003.326.5': {
                                                                        "description": "Хеттское рисуночное письмо",
                                                                        "keywords": ["Хеттское письмо", "рисуночное письмо", "Хетты", "хеттская культура"]
                                                                    }
                                                                }
                                                        },
                                                        '003.328': {
                                                            "description": "Пазиграфика. Письменности для искусственных языков (например, для эсперанто)",
                                                            "keywords": ["пазиграфика", "письменности для искусственных языков", "эсперанто"]
                                                        },
                                                        '003.329': {
                                                            "description": "Прочие идеографические и логографические письменности",
                                                            "keywords": ["прочие идеографические письменности", "прочие логографические письменности"]
                                                        }
                                                    }
                                            },
                                            '003.33/.34': {
                                                "description": "Алфавитные письменности",
                                                "keywords": ["алфавитные системы", "алфавитные письменности"],
                                                "subcategories": {
                                                    '003.33': {
                                                        "description": "Неевропейские алфавитные письменности",
                                                        "keywords": ["неевропейские алфавиты", "азиатские алфавиты", "семитские алфавиты"],
                                                        "subcategories": {
                                                                '003.332': {
                                                                    "description": "Семитские письменности. Синаитская письменность",
                                                                    "keywords": ["семитские письменности", "Синаитская письменность", "алфавиты Ближнего Востока"],
                                                                    "subcategories": {
                                                                            '003.332.1': {
                                                                                "description": "Ранние алфавитные письменности Средиземноморского бассейна. Синаитская письменность",
                                                                                "keywords": ["ранние письменности", "Средиземноморский бассейн", "Синаитская письменность"]
                                                                            },
                                                                            '003.332.2': {
                                                                                "description": "Финикийские письменности. Пунические письменности",
                                                                                "keywords": ["Финикийская письменность", "Пуническая письменность"]
                                                                            },
                                                                            '003.332.3': {
                                                                                "description": "Арамейские письменности",
                                                                                "keywords": ["Арамейская письменность", "арамейские алфавиты"]
                                                                            },
                                                                            '003.332.4': {
                                                                                "description": "Древнееврейская и ханаанская письменности",
                                                                                "keywords": ["Древнееврейская письменность", "ханаанская письменность"]
                                                                            },
                                                                            '003.332.5': {
                                                                                "description": "Арабские письменности. Турецкая (оттоманская), новоперсидская, афганская, урду (хиндустани) письменности",
                                                                                "keywords": ["арабские письменности", "турецкая письменность", "новоперсидская", "афганская", "урду"]
                                                                            },
                                                                            '003.332.6': {
                                                                                "description": "Южносемитские письменности",
                                                                                "keywords": ["Южносемитские письменности", "южносемитские алфавиты"]
                                                                            },
                                                                            '003.332.7': {
                                                                                "description": "Эфиопские письменности. Амхарская письменность",
                                                                                "keywords": ["эфиопские письменности", "амхарская письменность"]
                                                                            },
                                                                            '003.332.9': {
                                                                                "description": "Различные письменности, в основе которых лежат семитские письменности",
                                                                                "keywords": ["семитские алфавиты", "семитские корни", "различные системы письма"]
                                                                            }
                                                                        }
                                                                },
                                                                '003.333': {
                                                                    "description": "Иранские письменности",
                                                                    "keywords": ["иранские письменности", "письменности Ирана", "персидская письменность"],
                                                                    "subcategories": {
                                                                            '003.333.2': {
                                                                                "description": "Пехлеви",
                                                                                "keywords": ["пехлевийская письменность", "пехлеви", "среднеперсидская письменность"]
                                                                            },
                                                                            '003.333.3': {
                                                                                "description": "Авеста",
                                                                                "keywords": ["авестийская письменность", "Авеста", "древнеперсидская письменность"]
                                                                            }
                                                                        }
                                                                },
                                                                '003.334': {
                                                                    "description": "Кавказские письменности",
                                                                    "keywords": ["кавказские письменности", "алфавиты Кавказа", "грузинская письменность"],
                                                                    "subcategories": {
                                                                            '003.334.1': {
                                                                                "description": "Армянская письменность",
                                                                                "keywords": ["армянский алфавит", "армянская письменность", "армянские письменные знаки"]
                                                                            },
                                                                            '003.334.2': {
                                                                                "description": "Грузинская письменность",
                                                                                "keywords": ["грузинский алфавит", "грузинская письменность", "грузинские письменные знаки"]
                                                                            },
                                                                            '003.334.3': {
                                                                                "description": "Осетинская письменность",
                                                                                "keywords": ["осетинский алфавит", "осетинская письменность", "осетинские письменные знаки"]
                                                                            }
                                                                        }
                                                                },
                                                                '003.335': {
                                                                    "description": "Письменности Центральной и Северной Азии. Уйгурская, монгольская, калмыцкая письменности",
                                                                    "keywords": ["письменности Центральной Азии", "Уйгурская письменность", "монгольская письменность", "калмыцкая письменность"]
                                                                },
                                                                '003.336': {
                                                                    "description": "Индийские письменности",
                                                                    "keywords": ["индийские письменности", "письменности Индии", "санскрит"],
                                                                    "subcategories": {
                                                                            '003.336.2': {
                                                                                "description": "Карости (индобактрийская)",
                                                                                "keywords": ["карости", "индобактрийская письменность"]
                                                                            },
                                                                            '003.336.3': {
                                                                                "description": "Брахми и его варианты. Гупта. Деванагари",
                                                                                "keywords": ["брахми", "гупта", "деванагари", "индийские алфавиты"]
                                                                            },
                                                                            '003.336.4': {
                                                                                "description": "Письменности Северо-Восточной Индии. Письменности кайти, гуджарати, непали",
                                                                                "keywords": ["северо-восточная Индия", "кайти", "гуджарати", "непали"]
                                                                            },
                                                                            '003.336.5': {
                                                                                "description": "Тибетские письменности",
                                                                                "keywords": ["тибетские письменности", "тибетский алфавит"]
                                                                            },
                                                                            '003.336.6': {
                                                                                "description": "Письменности Южной Индии. Тамильская письменность",
                                                                                "keywords": ["южная Индия", "тамильская письменность", "тамильский алфавит"]
                                                                            }
                                                                        }
                                                                },
                                                                '003.337': {
                                                                    "description": "Письменности Юго-Восточной Азии (Индокитая). Бирманская письменность. Камбоджийская письменность. Индонезийские письменности. Письменности Филиппин и островов Малайского архипелага",
                                                                    "keywords": ["письменности Юго-Восточной Азии", "Бирманская письменность", "Камбоджийская письменность", "индонезийские письменности"]
                                                                },
                                                                '003.339': {
                                                                    "description": "Прочие неевропейские алфавитные письменности",
                                                                    "keywords": ["неевропейские письменности", "прочие алфавиты"],
                                                                    "subcategories": {
                                                                            '003.339.2': {
                                                                                "description": "Письменности североамериканских индейцев",
                                                                                "keywords": ["письменности индейцев", "североамериканские алфавиты", "коренные американские письменности"]
                                                                            },
                                                                            '003.339.3': {
                                                                                "description": "Письменности эскимосов",
                                                                                "keywords": ["письменности эскимосов", "эскимосский алфавит", "инуитские письменности"]
                                                                            }
                                                                        }
                                                                }
                                                            }
                                                    },
                                                    '003.34': {
                                                        "description": "Европейские алфавитные письменности",
                                                        "keywords": ["европейские алфавиты", "латинский алфавит", "греческий алфавит"],
                                                        "subcategories": {
                                                                '003.341': {
                                                                    "description": "Греческая письменность",
                                                                    "keywords": ["греческий алфавит", "греческая система письма", "древнегреческая письменность"]
                                                                },
                                                                '003.342': {
                                                                    "description": "Письменность народов Средиземноморья, созданная на основе греческого письма. Коптская письменность. Ликийская письменность. Фригийская письменность",
                                                                    "keywords": ["коптский алфавит", "ликийская письменность", "фригийская письменность"]
                                                                },
                                                                '003.343': {
                                                                    "description": "Древнеиталийские письменности",
                                                                    "keywords": ["древнеиталийские алфавиты", "италийская система письма", "староиталийские письменности"]
                                                                },
                                                                '003.344': {
                                                                    "description": "Латинская (романская) и созданные на ее основе письменности. Готские письменности. Италийские письменности",
                                                                    "keywords": ["латинский алфавит", "романские письменности", "готские алфавиты"]
                                                                },
                                                                '003.345': {
                                                                    "description": "Руны",
                                                                    "keywords": ["рунические алфавиты", "североевропейские руны", "руническая письменность"]
                                                                },
                                                                '003.346': {
                                                                    "description": "Огамы",
                                                                    "keywords": ["огамическая письменность", "огамические знаки", "ирландские огамы"]
                                                                },
                                                                '003.347': {
                                                                    "description": "Готская письменность Вульфилы",
                                                                    "keywords": ["готская письменность", "алфавит Вульфилы", "готская система письма"]
                                                                },
                                                                '003.348': {
                                                                    "description": "Албанская письменность",
                                                                    "keywords": ["албанский алфавит", "албанская система письма", "письменности Албании"]
                                                                },
                                                                '003.349': {
                                                                    "description": "Славянские письменности. Кириллица. Глаголица",
                                                                    "keywords": ["славянская письменность", "кириллица", "глаголица"],
                                                                    "subcategories": {
                                                                            '003.349.1': {
                                                                                "description": "Глаголица",
                                                                                "keywords": ["глаголическая письменность", "славянская глаголица", "старославянский алфавит"]
                                                                            },
                                                                            '003.349.2': {
                                                                                "description": "Церковнославянская письменность",
                                                                                "keywords": ["церковнославянский язык", "церковнославянская кириллица", "богослужебная письменность"]
                                                                            },
                                                                            '003.349.3': {
                                                                                "description": "Русская письменность",
                                                                                "keywords": ["русский алфавит", "русская кириллица", "русская система письма"],
                                                                                "subcategories": {
                                                                                        '003.349.3.038:811.161.2': {
                                                                                            "description": "Украинская письменность",
                                                                                            "keywords": ["украинская кириллица", "украинский алфавит", "украинская письменность"]
                                                                                        },
                                                                                        '003.349.3.038:811.512.133': {
                                                                                            "description": "Узбекская письменность",
                                                                                            "keywords": ["узбекская кириллица", "узбекский алфавит", "узбекская письменность"]
                                                                                        }
                                                                                    }
                                                                            }
                                                                        }
                                                                }
                                                            }
                                                    }
                                                }
                                            },
                                            '003.35': {
                                                "description": "Системы цифр",
                                                "keywords": ["цифровые системы", "числовые системы"],
                                                "subcategories": {
                                                        '003.354': {
                                                            "description": "Системы, использующие буквы алфавита в качестве цифр",
                                                            "keywords": ["буквенные системы", "числовые буквы", "алфавитные цифры"]
                                                        },
                                                        '003.356': {
                                                            "description": "Системы, использующие специальные знаки в качестве цифр",
                                                            "keywords": ["цифровые символы", "специальные цифровые знаки", "особые числовые знаки"],
                                                            "subcategories": {
                                                                    '003.356.2': {
                                                                        "description": "Арабские (индийские) цифры",
                                                                        "keywords": ["арабские цифры", "индийские цифры", "десятичная система"]
                                                                    }
                                                                }
                                                        }
                                                    }
                                            }
                                        }
                                },
                                '003.5': {
                                    "description": "Материалы для письма. Письменные принадлежности",
                                    "keywords": ["материалы для письма", "принадлежности"],
                                    "subcategories": {
                                                "003.51": {
                                                    "description": "Материалы для письма (бумага, дерево и др.)",
                                                    "keywords": ["бумага", "дерево", "материалы для письма"]
                                                },
                                                "003.57": {
                                                    "description": "Средства для письма. Чернила. Краски. Мелки. Грифели",
                                                    "keywords": ["чернила", "краски", "мелки", "грифели"]
                                                },
                                                "003.58": {
                                                    "description": "Орудия для письма. Палочки. Перья. Кисточки",
                                                    "keywords": ["палочки", "перья", "кисточки", "инструменты для письма"]
                                                }
                                            }
                                },
                                '003.6': {
                                    "description": "Прочие способы графического воспроизведения мысли",
                                    "keywords": ["графическое воспроизведение", "способы"],
                                    "subcategories": {
                                            '003.62': {
                                                "description": "Знаки и символы, не относящиеся к письменности",
                                                "keywords": ["знаки", "символы", "графические знаки"],
                                                "subcategories": {
                                                        '003.623': {
                                                            "description": "Обозначения. Условные обозначения. Идентификационные знаки",
                                                            "keywords": ["обозначения", "условные знаки", "идентификационные знаки"],
                                                            "subcategories": {
                                                                    '003.623:629.463': {
                                                                        "description": "Система обозначения товарных вагонов",
                                                                        "keywords": ["обозначение товарных вагонов", "идентификация вагонов", "железнодорожные знаки"]
                                                                    }
                                                                }
                                                        },
                                                        '003.625': {
                                                            "description": "Математические знаки",
                                                            "keywords": ["математические знаки", "символы", "операции"],
                                                            "subcategories": {
                                                                    '003.625:517.968': {
                                                                        "description": "Знаки интегральных уравнений",
                                                                        "keywords": ["интегральные знаки", "математические уравнения", "знаки интеграции"]
                                                                    }
                                                                }
                                                        },
                                                        '003.626': {
                                                            "description": "Лексикографические знаки",
                                                            "keywords": ["лексикографические знаки", "значки", "графические символы"],
                                                            "subcategories": {
                                                                '003.626:81\'374': {
                                                                    "description": "Знаки в словарях",
                                                                    "keywords": ["знаки", "лексикографические символы",
                                                                                 "обозначения в словарях"]
                                                                }
                                                            }
                                                        },
                                                        '003.628': {
                                                            "description": "Символы. Пиктограммы. Знаки-картинки (знаки-рисунки)",
                                                            "keywords": ["символы", "пиктограммы", "знаки-картинки", "знаки-рисунки"],
                                                            "subcategories": {
                                                                    '003.628:614.876.013': {
                                                                        "description": "Символы, знаки-картинки (знаки-рисунки), предупреждающие радиоактивную опасность",
                                                                        "keywords": ["радиоактивная опасность", "предупреждающие знаки", "символы опасности"]
                                                                    }
                                                                }
                                                        },
                                                        '003.62:006.92': {
                                                            "description": "Транскрипция времени. Обозначения времени",
                                                            "keywords": ["транскрипция времени", "обозначения времени", "временные знаки"]
                                                        }
                                                    }
                                            },
                                            '003.63': {
                                                "description": "Диаграммы. Картограммы. Схемы",
                                                "keywords": ["диаграммы", "схемы", "картограммы", "графическое представление"]
                                            },
                                            '003.64': {
                                                "description": "Монограммы. Анаграммы. Хронограммы. Сигнатура как признак происхождения",
                                                "keywords": ["монограммы", "анаграммы", "хронограммы", "сигнатура", "фирменные знаки"]
                                            },
                                            '003.65': {
                                                "description": "Знаки качества. Фабричные марки. Клейма",
                                                "keywords": ["знаки качества", "фабричные марки", "клейма", "маркировка"]
                                            },
                                            '003.69': {
                                                "description": "Прочие графические знаки",
                                                "keywords": ["графические знаки", "символы", "значки"]
                                            }
                                        }
                                }
                            }
                    },
                    '004': {
                        "description": "Информационные технологии. Вычислительная техника. Обработка данных",
                        "keywords": ["информационные технологии", "вычислительная техника", "обработка данных"],
                        "subcategories": {
                                '004.0': {
                                    "description": "",  # Оставлено пустым
                                    "keywords": [],
                                    "subcategories": {
                                            '004.01': {
                                                "description": "Документация",
                                                "keywords": ["документация", "технические документы", "инструкции"]
                                            },
                                            '004.02': {
                                                "description": "Методы решения задач",
                                                "keywords": ["методы решения задач", "алгоритмы", "подходы к решению"],
                                                "subcategories": {
                                                        '004.021': {
                                                            "description": "Алгоритмы",
                                                            "keywords": ["алгоритмы", "шаги решения", "структурированные методы"]
                                                        },
                                                        '004.023': {
                                                            "description": "Эвристические методы",
                                                            "keywords": ["эвристика", "эвристические методы", "приближенные решения"]
                                                        }
                                                    }
                                            },
                                            '004.03': {
                                                "description": "Типы и характеристики систем",
                                                "keywords": ["типы систем", "характеристики систем", "классификация"],
                                                "subcategories": {
                                                        '004.031': {
                                                            "description": "Типы систем",
                                                            "keywords": ["типы систем", "виды компьютерных систем", "классификация систем"],
                                                            "subcategories": {
                                                                    '004.031.2': {
                                                                        "description": "Автономные системы. Системы с пакетной обработкой",
                                                                        "keywords": ["автономные системы", "системы с пакетной обработкой", "офлайн системы"]
                                                                    },
                                                                    '004.031.4': {
                                                                        "description": "Неавтономные системы. Онлайновые системы",
                                                                        "keywords": ["неавтономные системы", "онлайновые системы", "системы реального времени"],
                                                                        "subcategories": {
                                                                                '004.031.42': {
                                                                                    "description": "Интерактивные системы",
                                                                                    "keywords": ["интерактивные системы", "пользовательский интерфейс", "человеко-машинное взаимодействие"]
                                                                                },
                                                                                '004.031.43': {
                                                                                    "description": "Системы реального времени. Системы обработки транзакций",
                                                                                    "keywords": ["системы реального времени", "обработка транзакций", "онлайн-обработка данных"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '004.031.6': {
                                                                        "description": "Встроенные системы",
                                                                        "keywords": ["встроенные системы", "embedded systems", "интегрированные системы"]
                                                                    }
                                                                }
                                                        },
                                                        '004.032': {
                                                            "description": "Характеристики систем",
                                                            "keywords": ["характеристики систем", "производительность", "надежность"],
                                                            "subcategories": {
                                                                    '004.032.2': {
                                                                        "description": "Режим обработки данных",
                                                                        "keywords": ["режим обработки данных", "режимы работы системы", "пакетная обработка", "интерактивный режим"],
                                                                        "subcategories": {
                                                                                '004.032.22': {
                                                                                    "description": "Последовательный режим обработки",
                                                                                    "keywords": ["последовательная обработка", "последовательный режим", "пошаговая обработка"]
                                                                                },
                                                                                '004.032.24': {
                                                                                    "description": "Параллельный, одновременный режим обработки",
                                                                                    "keywords": ["параллельная обработка", "одновременная обработка", "многозадачность"]
                                                                                },
                                                                                '004.032.26': {
                                                                                    "description": "Нейронные сети",
                                                                                    "keywords": ["нейронные сети", "искусственные нейронные сети", "глубокое обучение"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '004.032.3': {
                                                                        "description": "Согласование по времени. Задание времени цикла",
                                                                        "keywords": ["согласование по времени", "временные параметры", "время цикла"],
                                                                        "subcategories": {
                                                                            '004.032.32': {
                                                                                "description": "Синхронные процессы",
                                                                                "keywords": ["синхронные процессы",
                                                                                             "синхронизация",
                                                                                             "управление временем"],
                                                                                "subcategories": {
                                                                                        '004.032.322': {
                                                                                            "description": "Синхронизирующая частота. Тактовая частота",
                                                                                            "keywords": ["тактовая частота", "синхронизирующая частота", "частота процессора"]
                                                                                        },
                                                                                        '004.032.324': {
                                                                                            "description": "Период синхронизирующих импульсов. Такт. Машинный цикл. Цикл внутреннего тактирования",
                                                                                            "keywords": ["период импульсов", "машинный цикл", "внутренний такт", "временные циклы"]
                                                                                        }
                                                                                    }
                                                                            },
                                                                            '004.032.34': {
                                                                                "description": "Асинхронные процессы",
                                                                                "keywords": ["асинхронные процессы",
                                                                                             "несинхронизированные процессы",
                                                                                             "управление асинхронными событиями"]
                                                                            }
                                                                        }
                                                                    },
                                                                    '004.032.6': {
                                                                        "description": "Мультимедиа",
                                                                        "keywords": ["мультимедиа", "мультимедийные системы", "обработка мультимедийных данных"]
                                                                    },
                                                                    '004.032.8': {
                                                                        "description": "Поколения компьютеров",
                                                                        "keywords": ["поколения компьютеров", "эволюция ЭВМ", "развитие компьютерных технологий"],
                                                                        "subcategories": {
                                                                                '004.032.84': {
                                                                                    "description": "Компьютеры четвертого поколения",
                                                                                    "keywords": ["четвертое поколение компьютеров", "микропроцессоры", "высокая интеграция"]
                                                                                }
                                                                            }
                                                                    }
                                                                }
                                                        }
                                                    }
                                            },
                                            '004.04': {
                                                "description": "Ориентация процесса обработки данных",
                                                "keywords": ["обработка данных", "процесс обработки", "ориентация"],
                                                "subcategories": {
                                                        '004.041': {
                                                            "description": "Процедурная",
                                                            "keywords": ["процедурная ориентация", "последовательное выполнение"]
                                                        },
                                                        '004.042': {
                                                            "description": "На поток данных",
                                                            "keywords": ["поток данных", "обработка данных по потоку"]
                                                        },
                                                        '004.043': {
                                                            "description": "На структуру данных",
                                                            "keywords": ["структура данных", "ориентация на структуру"]
                                                        },
                                                        '004.045': {
                                                            "description": "Объектная",
                                                            "keywords": ["объектная ориентация", "объекты и классы"]
                                                        },
                                                        '004.046': {
                                                            "description": "Функциональная",
                                                            "keywords": ["функциональная ориентация", "функциональное программирование"]
                                                        },
                                                        '004.047': {
                                                            "description": "Логическая",
                                                            "keywords": ["логическая ориентация", "логическое программирование"]
                                                        },
                                                        '004.048': {
                                                            "description": "На реализацию искусственного интеллекта",
                                                            "keywords": ["искусственный интеллект", "ориентация на ИИ"]
                                                        }
                                                    }
                                            },
                                            '004.05': {
                                                "description": "Качество систем и программ",
                                                "keywords": ["качество систем", "качество программ", "проверка качества"],
                                                "subcategories": {
                                                        '004.051': {
                                                            "description": "Эффективность",
                                                            "keywords": ["эффективность системы", "производительность"]
                                                        },
                                                        '004.052': {
                                                            "description": "Надежность и точность",
                                                            "keywords": ["надежность программ", "точность данных"],
                                                            "subcategories": {
                                                                    '004.052.2': {
                                                                        "description": "Устойчивость к ошибкам, живучесть",
                                                                        "keywords": ["устойчивость к ошибкам", "живучесть систем"]
                                                                    },
                                                                    '004.052.3': {
                                                                        "description": "Отказоустойчивость",
                                                                        "keywords": ["отказоустойчивость систем", "устойчивость к сбоям"],
                                                                        "subcategories": {
                                                                                '004.052.32': {
                                                                                    "description": "Контроль неисправностей",
                                                                                    "keywords": ["контроль неисправностей", "методы диагностики"]
                                                                                },
                                                                                '004.052.34': {
                                                                                    "description": "Порог неисправностей",
                                                                                    "keywords": ["порог неисправностей", "допустимые уровни неисправностей"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '004.052.4': {
                                                                        "description": "Защита от ошибок. Обработка ошибок",
                                                                        "keywords": ["защита от ошибок", "методы обработки ошибок"],
                                                                        "subcategories": {
                                                                                '004.052.42': {
                                                                                    "description": "Обнаружение ошибок. Контроль допустимости. Проверка достоверности данных. Верификация данных",
                                                                                    "keywords": ["обнаружение ошибок", "контроль допустимости", "проверка достоверности", "верификация данных"]
                                                                                },
                                                                                '004.052.44': {
                                                                                    "description": "Исправление ошибок",
                                                                                    "keywords": ["исправление ошибок", "методы коррекции"]
                                                                                }
                                                                            }
                                                                    }
                                                                }
                                                        },
                                                        '004.053': {
                                                            "description": "Возможность многократного использования",
                                                            "keywords": ["многократное использование", "реиспользование компонентов"]
                                                        },
                                                        '004.054': {
                                                            "description": "Тестируемость, оцениваемость",
                                                            "keywords": ["тестируемость системы", "методы оценки"]
                                                        },
                                                        '004.055': {
                                                            "description": "Дружественность к пользователю",
                                                            "keywords": ["удобство использования", "интерфейс пользователя"]
                                                        },
                                                        '004.056': {
                                                            "description": "Безопасность, защищенность данных",
                                                            "keywords": ["безопасность системы", "защита данных"],
                                                            "subcategories": {
                                                                    '004.056.2': {
                                                                        "description": "Целостность данных",
                                                                        "keywords": ["целостность данных", "защита данных от изменений"]
                                                                    },
                                                                    '004.056.3': {
                                                                        "description": "Резервирование и восстановление данных",
                                                                        "keywords": ["резервирование данных", "восстановление данных", "планы восстановления"]
                                                                    },
                                                                    '004.056.4': {
                                                                        "description": "Избыточность",
                                                                        "keywords": ["избыточность данных", "избыточные системы"]
                                                                    },
                                                                    '004.056.5': {
                                                                        "description": "Защита",
                                                                        "keywords": ["защита данных", "механизмы безопасности"],
                                                                        "subcategories": {
                                                                                '004.056.52': {
                                                                                    "description": "Ограничение доступа. Брандмауэр",
                                                                                    "keywords": ["ограничение доступа", "брандмауэр", "файрвол"],
                                                                                    "subcategories": {
                                                                                            '004.056.523': {
                                                                                                "description": "Идентификация и авторизация",
                                                                                                "keywords": ["идентификация", "авторизация", "доступ"]
                                                                                            }
                                                                                        }
                                                                                },
                                                                                '004.056.53': {
                                                                                    "description": "Защита от несанкционированного доступа. Защита от взлома",
                                                                                    "keywords": ["несанкционированный доступ", "защита от взлома"]
                                                                                },
                                                                                '004.056.54': {
                                                                                    "description": "Защита от шпионских программ. Защита от программ с рекламной поддержкой, рекламных программ-роботов (ad bots)",
                                                                                    "keywords": ["шпионские программы", "рекламные программы", "ad bots"]
                                                                                },
                                                                                '004.056.55': {
                                                                                    "description": "Шифрование",
                                                                                    "keywords": ["шифрование данных", "методы шифрования"]
                                                                                },
                                                                                '004.056.57': {
                                                                                    "description": "Защита от компьютерных вирусов",
                                                                                    "keywords": ["защита от вирусов", "антивирусные программы"]
                                                                                }
                                                                            }
                                                                    }
                                                                }
                                                        },
                                                        '004.057': {
                                                            "description": "Совместимость",
                                                            "keywords": ["совместимость систем", "интероперабельность"],
                                                            "subcategories": {
                                                                    '004.057.2': {
                                                                        "description": "Стандартизация. Соответствие стандартам",
                                                                        "keywords": ["стандартизация", "соответствие стандартам"]
                                                                    },
                                                                    '004.057.3': {
                                                                        "description": "Форматы",
                                                                        "keywords": ["форматы данных", "форматы файлов"]
                                                                    },
                                                                    '004.057.4': {
                                                                        "description": "Протоколы",
                                                                        "keywords": ["протоколы связи", "сетевые протоколы"]
                                                                    },
                                                                    '004.057.5': {
                                                                        "description": "Переносимость, мобильность",
                                                                        "keywords": ["переносимость", "мобильность"]
                                                                    },
                                                                    '004.057.6': {
                                                                        "description": "Конвертирование",
                                                                        "keywords": ["конвертация", "преобразование данных"]
                                                                    },
                                                                    '004.057.7': {
                                                                        "description": "Эмуляция",
                                                                        "keywords": ["эмуляция", "виртуализация"]
                                                                    },
                                                                    '004.057.8': {
                                                                        "description": "Открытые системы. Открытая архитектура",
                                                                        "keywords": ["открытые системы", "открытая архитектура"]
                                                                    }
                                                                }
                                                        }
                                                    }
                                            },
                                            '004.07': {
                                                "description": "Характеристики памяти",
                                                "keywords": ["память", "тип памяти", "характеристики памяти"],
                                                "subcategories": {
                                                        '004.072': {
                                                            "description": "Функционирование памяти",
                                                            "keywords": ["функционирование памяти", "операции памяти"],
                                                            "subcategories": {
                                                                    '004.072.2': {
                                                                        "description": "Чтение",
                                                                        "keywords": ["чтение памяти", "операции чтения"]
                                                                    },
                                                                    '004.072.3': {
                                                                        "description": "Запись",
                                                                        "keywords": ["запись памяти", "операции записи"]
                                                                    },
                                                                    '004.072.4': {
                                                                        "description": "Доступ",
                                                                        "keywords": ["доступ к памяти", "режимы доступа"]
                                                                    },
                                                                    '004.072.5': {
                                                                        "description": "Адресация",
                                                                        "keywords": ["адресация памяти", "методы адресации"]
                                                                    },
                                                                    '004.072.6': {
                                                                        "description": "Поблочная передача",
                                                                        "keywords": ["поблочная передача", "методы передачи"]
                                                                    }
                                                                }
                                                        },
                                                        '004.074': {
                                                            "description": "Эффективность памяти",
                                                            "keywords": ["эффективность памяти", "производительность памяти"],
                                                            "subcategories": {
                                                                    '004.074.2': {
                                                                        "description": "Плотность записи",
                                                                        "keywords": ["плотность записи", "эффективность записи"]
                                                                    },
                                                                    '004.074.3': {
                                                                        "description": "Время доступа",
                                                                        "keywords": ["время доступа", "скорость доступа"],
                                                                        "subcategories": {
                                                                                '004.074.32': {
                                                                                    "description": "Время позиционирования. Время установки головок",
                                                                                    "keywords": ["время позиционирования", "установка головок"]
                                                                                },
                                                                                '004.074.34': {
                                                                                    "description": "Время цикла памяти",
                                                                                    "keywords": ["время цикла", "цикл памяти"]
                                                                                }
                                                                            }
                                                                    }
                                                                }
                                                        },
                                                        '004.076': {
                                                            "description": "Энергозависимость",
                                                            "keywords": ["энергозависимость", "тип памяти"],
                                                            "subcategories": {
                                                                    '004.076.2': {
                                                                        "description": "Энергозависимая память",
                                                                        "keywords": ["энергозависимая память"]
                                                                    },
                                                                    '004.076.4': {
                                                                        "description": "Энергонезависимая память",
                                                                        "keywords": ["энергонезависимая память"]
                                                                    }
                                                                }
                                                        }
                                                    }
                                            },
                                            '004.08': {
                                                "description": "Устройства ввода - вывода. Носители данных",
                                                "keywords": ["устройства ввода", "устройства вывода", "носители данных"],
                                                "subcategories": {
                                                        '004.081': {
                                                            "description": "Перфоносители",
                                                            "keywords": ["перфоносители", "перфокарты", "перфоленты"],
                                                            "subcategories": {
                                                                    '004.081.1': {
                                                                        "description": "Перфокарты",
                                                                        "keywords": ["перфокарты", "использование перфокарт", "история перфокарт"]
                                                                    },
                                                                    '004.081.2': {
                                                                        "description": "Перфоленты",
                                                                        "keywords": ["перфоленты", "использование перфолент", "история перфолент"]
                                                                    }
                                                                }
                                                        },
                                                        '004.083': {
                                                            "description": "Магнитные носители",
                                                            "keywords": ["магнитные носители", "магнитные ленты", "жесткие диски"],
                                                            "subcategories": {
                                                                    '004.083.1': {
                                                                        "description": "Магнитные карты",
                                                                        "keywords": ["магнитные карты", "применение магнитных карт", "безопасность магнитных карт"]
                                                                    },
                                                                    '004.083.2': {
                                                                        "description": "Магнитные полоски",
                                                                        "keywords": ["магнитные полоски", "использование магнитных полосок", "технологии магнитных полосок"]
                                                                    },
                                                                    '004.083.3': {
                                                                        "description": "Магнитные чернила",
                                                                        "keywords": ["магнитные чернила", "применение магнитных чернил", "технология магнитных чернил"]
                                                                    },
                                                                    '004.083.4': {
                                                                        "description": "Магнитные ленты",
                                                                        "keywords": ["магнитные ленты", "использование магнитных лент", "типы магнитных лент"],
                                                                        "subcategories": {
                                                                                '004.083.42': {
                                                                                    "description": "Катушечные ленты",
                                                                                    "keywords": ["катушечные ленты", "применение катушечных лент", "типы катушечных лент"]
                                                                                },
                                                                                '004.083.44': {
                                                                                    "description": "Двухкатушечные компакт-кассеты",
                                                                                    "keywords": ["двухкатушечные компакт-кассеты", "использование компакт-кассет", "типы компакт-кассет"]
                                                                                },
                                                                                '004.083.45': {
                                                                                    "description": "Ленточные картриджи",
                                                                                    "keywords": ["ленточные картриджи", "применение ленточных картриджей", "типы ленточных картриджей"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '004.083.5': {
                                                                        "description": "Магнитные сердечники",
                                                                        "keywords": ["магнитные сердечники", "тип магнитных сердечников", "применение магнитных сердечников"]
                                                                    },
                                                                    '004.083.6': {
                                                                        "description": "Магнитные барабаны",
                                                                        "keywords": ["магнитные барабаны", "история магнитных барабанов", "применение магнитных барабанов"]
                                                                    },
                                                                    '004.083.7': {
                                                                        "description": "Магнитные диски",
                                                                        "keywords": ["магнитные диски", "применение магнитных дисков", "типы магнитных дисков"],
                                                                        "subcategories": {
                                                                                '004.083.72': {
                                                                                    "description": "Жесткие диски",
                                                                                    "keywords": ["жесткие диски", "HDD", "характеристики жестких дисков"],
                                                                                    "subcategories": {
                                                                                            '004.083.722': {
                                                                                                "description": "Пакеты дисков",
                                                                                                "keywords": ["пакеты дисков", "упаковка жестких дисков"]
                                                                                            },
                                                                                            '004.083.723': {
                                                                                                "description": "Матрицы дисков",
                                                                                                "keywords": ["матрицы дисков", "структура жестких дисков"]
                                                                                            }
                                                                                        }
                                                                                },
                                                                                '004.083.74': {
                                                                                    "description": "Гибкие диски. Дискеты",
                                                                                    "keywords": ["гибкие диски", "дискеты", "типичные применения гибких дисков"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '004.083.8': {
                                                                        "description": "Память на магнитных пленках",
                                                                        "keywords": ["тонкопленочная память", "память на цилиндрических магнитных доменах", "ЦМД-ЗУ"]
                                                                    }
                                                                }
                                                        },
                                                        '004.084': {
                                                            "description": "Магнитооптические носители. Стираемые оптические диски",
                                                            "keywords": ["магнитооптические диски", "стираемые оптические носители"]
                                                        },
                                                        '004.085': {
                                                            "description": "Оптические носители (нестираемые)",
                                                            "keywords": ["оптические диски", "CD", "DVD", "Blu-ray"],
                                                            "subcategories": {
                                                                    '004.085.2': {
                                                                        "description": "Компакт-диски (CD)",
                                                                        "keywords": ["компакт-диски", "CD", "аудио CD", "данные CD"],
                                                                        "subcategories": {
                                                                                '004.085.22': {
                                                                                    "description": "Компакт-диски с данными, доступными только для чтения (СD-ROM)",
                                                                                    "keywords": ["CD-ROM", "диски только для чтения", "данные на CD"]
                                                                                },
                                                                                '004.085.23': {
                                                                                    "description": "Компакт-диски однократной записи информации (CD-R). Компакт-диски для многократной записи (CD-RW)",
                                                                                    "keywords": ["CD-R", "CD-RW", "однократная запись", "многократная запись"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '004.085.3': {
                                                                        "description": "Диски однократной записи и многократного считывания (WORM)",
                                                                        "keywords": ["WORM", "диски однократной записи", "многократного считывания"]
                                                                    },
                                                                    '004.085.4': {
                                                                        "description": "Видеодиски, лазерные диски (LD)",
                                                                        "keywords": ["лазерные диски", "видеодиски", "LD"]
                                                                    },
                                                                    '004.085.5': {
                                                                        "description": "Цифровые диски (DVD)",
                                                                        "keywords": ["DVD", "цифровые диски", "видео DVD"]
                                                                    },
                                                                    '004.085.6': {
                                                                        "description": "Оптические диски формата Blue-ray",
                                                                        "keywords": ["Blue-ray", "оптические диски", "HD видео"]
                                                                    },
                                                                    '004.085.7': {
                                                                        "description": "Цифровая бумага",
                                                                        "keywords": ["цифровая бумага", "интерактивные носители"],
                                                                        "subcategories": {
                                                                                '004.085.72': {
                                                                                    "description": "Цифробумажная лента",
                                                                                    "keywords": ["цифробумажная лента", "ленты для хранения данных"]
                                                                                },
                                                                                '004.085.74': {
                                                                                    "description": "Цифробумажные диски",
                                                                                    "keywords": ["цифробумажные диски", "диски для цифровой информации"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '004.085.8': {
                                                                        "description": "Голографические носители данных. Голографический многоцелевой диск (HVD)",
                                                                        "keywords": ["голографические носители", "HVD", "голографическая память"]
                                                                    }
                                                                }
                                                        },
                                                        '004.087': {
                                                            "description": "Электронные носители",
                                                            "keywords": ["электронные носители", "флеш-накопители", "SSD"],
                                                            "subcategories": {
                                                                    '004.087.2': {
                                                                        "description": "Полупроводниковая память. Твердотелые диски. Флеш-память на дисках",
                                                                        "keywords": ["полупроводниковая память", "твердотелые диски", "флеш-память"]
                                                                    },
                                                                    '004.087.4': {
                                                                        "description": "Платы памяти. ПК-платы (PC-cards)",
                                                                        "keywords": ["платы памяти", "ПК-платы", "PC-cards"]
                                                                    },
                                                                    '004.087.5': {
                                                                        "description": "Интеллектуальные платы. Платы команд. Smart cards. IC cards.",
                                                                        "keywords": ["интеллектуальные платы", "платы команд", "Smart cards", "IC cards"]
                                                                    }
                                                                }
                                                        }
                                                    }
                                            }
                                        }
                                },
                                '004.2': {
                                    "description": "Архитектура вычислительных машин",
                                    "keywords": ["архитектура вычислительных машин", "структура компьютеров"],
                                    "subcategories": {
                                            '004.22': {
                                                "description": "Представление данных",
                                                "keywords": ["представление данных", "форматы данных", "кодирование"],
                                                "subcategories": {
                                                        '004.222': {
                                                            "description": "Численные данные",
                                                            "keywords": ["числовые данные", "целые числа", "числа с плавающей запятой"],
                                                            "subcategories": {
                                                                    '004.222.2': {
                                                                        "description": "Представление чисел с фиксированной запятой (точкой)",
                                                                        "keywords": ["фиксированная запятая", "целые числа", "форматы хранения чисел"]
                                                                    },
                                                                    '004.222.3': {
                                                                        "description": "Представление чисел с плавающей запятой (точкой)",
                                                                        "keywords": ["плавающая запятая", "формат IEEE 754", "точность чисел"]
                                                                    },
                                                                    '004.222.5': {
                                                                        "description": "Переполнение. Потеря значимости",
                                                                        "keywords": ["переполнение", "потеря точности", "числовые ошибки"]
                                                                    }
                                                                }
                                                        },
                                                        '004.223': {
                                                            "description": "Символьные и другие подобные данные",
                                                            "keywords": ["символьные данные", "строки", "таблицы", "дата и время"],
                                                            "subcategories": {
                                                                    '004.223.2': {
                                                                        "description": "Алфавитно-цифровые данные",
                                                                        "keywords": ["алфавитно-цифровые символы", "буквы", "цифры"],
                                                                        "subcategories": {
                                                                                '004.223.2:003.332.5': {
                                                                                    "description": "Представление арабской письменности",
                                                                                    "keywords": ["арабская письменность", "арабские символы", "алфавит"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '004.223.3': {
                                                                        "description": "Графические знаки, включая двухбайтовое и трехбайтовое представление",
                                                                        "keywords": ["графические символы", "двухбайтовые символы", "трехбайтовые символы"],
                                                                        "subcategories": {
                                                                                '004.223.3:003.324.1': {
                                                                                    "description": "Представление китайской письменности",
                                                                                    "keywords": ["китайская письменность", "китайские иероглифы", "двухбайтовые символы"]
                                                                                }
                                                                            }
                                                                    },
                                                                    '004.223.5': {
                                                                        "description": "Специальные символы",
                                                                        "keywords": ["специальные знаки", "символы валют", "знаки пунктуации"]
                                                                    },
                                                                    '004.223.6': {
                                                                        "description": "Управляющие символы",
                                                                        "keywords": ["управляющие знаки", "управление потоком данных", "символы управления"]
                                                                    },
                                                                    '004.223.7': {
                                                                        "description": "Переключающие символы. Ключи перехода",
                                                                        "keywords": ["переключающие символы", "символы перехода", "ключи управления"]
                                                                    }
                                                                }
                                                        }
                                                    }
                                            },
                                            '004.23': {
                                                "description": "Структура системы команд",
                                                "keywords": ["система команд", "командные структуры", "архитектура команд"],
                                                "subcategories": {
                                                        '004.231': {
                                                            "description": "Виды систем команд",
                                                            "keywords": ["виды систем команд", "классификация команд"],
                                                            "subcategories": {
                                                                    '004.231.2': {
                                                                        "description": "Вычислительные машины с полной системой команд (CISC)",
                                                                        "keywords": ["CISC", "полная система команд", "вычислительные машины CISC"]
                                                                    },
                                                                    '004.231.3': {
                                                                        "description": "Вычислительные машины с сокращенным набором команд (RISC)",
                                                                        "keywords": ["RISC", "сокращенный набор команд", "вычислительные машины RISC"]
                                                                    }
                                                                }
                                                        },
                                                        '004.232': {
                                                            "description": "Формат команд",
                                                            "keywords": ["формат команд", "структура команды"]
                                                        },
                                                        '004.233': {
                                                            "description": "Виды команд",
                                                            "keywords": ["виды команд", "типизация команд"]
                                                        },
                                                        '004.234': {
                                                            "description": "Регистры",
                                                            "keywords": ["регистры", "регистровая архитектура"]
                                                        },
                                                        '004.235': {
                                                            "description": "Схемы адресации",
                                                            "keywords": ["адресация", "схемы адресации", "методы адресации"]
                                                        },
                                                        '004.236': {
                                                            "description": "Подпрограммы в системе команд",
                                                            "keywords": ["подпрограммы", "вызов подпрограмм"]
                                                        },
                                                        '004.237': {
                                                            "description": "Прерывания",
                                                            "keywords": ["прерывания", "обработка прерываний"]
                                                        },
                                                        '004.238': {
                                                            "description": "Состояние процесса",
                                                            "keywords": ["состояние процесса", "управление процессами"]
                                                        },
                                                        '004.239': {
                                                            "description": "Защита памяти",
                                                            "keywords": ["защита памяти", "управление памятью", "безопасность памяти"]
                                                        }
                                                    }
                                            },
                                            '004.25': {
                                                "description": "Системы памяти",
                                                "keywords": ["системы памяти", "тип памяти", "организация памяти"]
                                            },
                                            '004.27': {
                                                "description": "Перспективные архитектуры. Нефоннеймановские архитектуры",
                                                "keywords": ["перспективные архитектуры", "нефоннеймановские архитектуры", "будущее вычислительных машин"]
                                            }
                                        }
                                },
                                '004.3': {
                                    "description": "Аппаратные средства. Техническое обеспечение",
                                    "keywords": ["аппаратные средства", "техническое обеспечение", "компьютерные компоненты"]
                                },
                                '004.4': {
                                    "description": "Программные средства",
                                    "keywords": ["программное обеспечение", "программы", "операционные системы"]
                                },
                                '004.5': {
                                    "description": "Человеко-машинное взаимодействие. Человеко-машинный интерфейс. Пользовательский интерфейс. Операционная среда пользователя",
                                    "keywords": ["человеко-машинное взаимодействие", "пользовательский интерфейс", "интерактивные системы"]
                                },
                                '004.6': {
                                    "description": "Данные",
                                    "keywords": ["данные", "информация", "хранение данных"]
                                },
                                '004.7': {
                                    "description": "Связь компьютеров. Сети ЭВМ. Вычислительные сети",
                                    "keywords": ["компьютерные сети", "сети ЭВМ", "сетевая архитектура"]
                                },
                                '004.8': {
                                    "description": "Искусственный интеллект",
                                    "keywords": ["искусственный интеллект", "машинное обучение", "нейронные сети"]
                                },
                                '004.9': {
                                    "description": "Прикладные информационные (компьютерные) технологии. Методы, основанные на применении компьютеров",
                                    "keywords": ["прикладные технологии", "информационные технологии", "методы вычислений"]
                                }
                            }
                    },
                    '005': {
                        "description": "Управление. Менеджмент",
                        "keywords": ["управление", "менеджмент"]
                    },
                    '006': {
                        "description": "Стандартизация продукции, процессов, мер, весов и времени. Стандарты. Технические требования. Нормы и правила. Рекомендации",
                        "keywords": ["стандартизация", "продукция", "технические требования", "нормы", "правила"]
                    },
                    '007': {
                        "description": "Деятельность и организация. Общая теория связи и управления (кибернетика)",
                        "keywords": ["деятельность", "организация", "теория связи", "кибернетика"]
                    },
                    '008': {
                        "description": "Цивилизация. Культура. Прогресс",
                        "keywords": ["цивилизация", "культура", "прогресс"]
                    },
                    '009': {
                        "description": "Гуманитарные науки в целом",
                        "keywords": ["гуманитарные науки"]
                    }
                }
            },
            '01': {
                "description": "Библиография и библиографии. Каталоги",
                "keywords": ["библиография", "каталоги", "источники"],

            },
            '02': {
                "description": "Библиотечное дело. Библиотековедение",
                "keywords": ["библиотечное дело", "библиотековедение", "библиотеки"]
            },
            '03': {
                "description": "",  # Можно добавить позже
                "keywords": []
            },
            '05': {
                "description": "",  # Можно добавить позже
                "keywords": []
            },
            '06': {
                "description": "Организации вообще. Ассоциации. Музеи",
                "keywords": ["организации", "ассоциации", "музеи"]
            },
            '07': {
                "description": "",  # Можно добавить позже
                "keywords": []
            },
            '08': {
                "description": "Издания смешанного содержания. Сборники",
                "keywords": ["издания", "сборники", "смешанное содержание"]
            },
            '09': {
                "description": "Рукописи. Редкие книги",
                "keywords": ["рукописи", "редкие книги"]
            }
        }
    },
    '1': {
        "description": "Философия. Психология",
        "keywords": ["философия", "психология", "мышление", "познание", "духовность", "сознание", "мировоззрение"],
        "subcategories": {
                    "10": {
                        "description": "",
                        "keywords": []
                    },
                    "11": {
                        "description": "Метафизика",
                        "keywords": ["метафизика"]
                    },
                    "12": {
                        "description": "Кардинальные вопросы философии: причинность, соотношение свободы и необходимости, телеология, конечность/бесконечность мира, смысл жизни, сущность души",
                        "keywords": ["причинность", "свобода", "необходимость", "телеология", "смысл жизни", "душа"]
                    },
                    "13": {
                        "description": "Философия разума и духа. Метафизика духовной жизни",
                        "keywords": ["философия разума", "дух", "метафизика духовной жизни"]
                    },
                    "14": {
                        "description": "Философские системы и концепции",
                        "keywords": ["философские системы", "концепции"]
                    },
                    "15": {
                        "description": "",
                        "keywords": []
                    },
                    "16": {
                        "description": "Логика. Эпистемология. Теория познания. Методология и логика науки",
                        "keywords": ["логика", "эпистемология", "теория познания", "методология науки"]
                    },
                    "17": {
                        "description": "Этика. Учение о морали. Практическая философия",
                        "keywords": ["этика", "мораль", "практическая философия"]
                    },
                    "18": {
                        "description": "Эстетика",
                        "keywords": ["эстетика", "исключено"]
                    },
                    "19": {
                        "description": "История философии",
                        "keywords": ["история философии"]
                    }
                }
    },
    '2': {
        "description": "Религия. Богословие",
        "keywords": ["религия", "богословие", "вера", "религиозный", "духовность", "церковь", "бог"],
        "subcategories": {
                    "2-": {
                        "description": "",
                        "keywords": []
                    },
                    "21/29": {
                        "description": "Религиозные системы. Религии, верования",
                        "keywords": ["религиозные системы", "верования"]
                    },
                    "21": {
                        "description": "Доисторические и примитивные религии",
                        "keywords": ["доисторические религии", "примитивные религии"]
                    },
                    "22": {
                        "description": "Религии дальневосточного происхождения",
                        "keywords": ["дальневосточные религии"]
                    },
                    "23": {
                        "description": "Религии Индийского субконтинента. Индуистская религия в широком смысле",
                        "keywords": ["индуизм", "религии Индии"]
                    },
                    "24": {
                        "description": "Буддизм",
                        "keywords": ["буддизм"]
                    },
                    "25": {
                        "description": "Религии античности. Второстепенные культы и религии",
                        "keywords": ["античные религии", "второстепенные культы"]
                    },
                    "26": {
                        "description": "Иудаизм",
                        "keywords": ["иудаизм"]
                    },
                    "27": {
                        "description": "Христианство",
                        "keywords": ["христианство"]
                    },
                    "28": {
                        "description": "Ислам",
                        "keywords": ["ислам"]
                    },
                    "29": {
                        "description": "Современные духовные течения",
                        "keywords": ["современные духовные течения"]
                    }
                }
    },
    '3': {
        "description": "Общественные науки. Статистика. Политика. Экономика. Торговля. Право. Государство. Военное дело. Социальное обеспечение. Страхование. Образование. Фольклор",
        "keywords": ["общество", "статистика", "политика", "экономика", "торговля", "право", "государство",
                     "военное дело", "социальное обеспечение", "страхование", "образование", "фольклор"],
"subcategories": {
            "3.0": {
                "description": "",
                "keywords": []
            },
            "30": {
                "description": "Теория, методология и методы общественных наук в целом. Социография",
                "keywords": ["методология", "социография"]
            },
            "31": {
                "description": "Демография. Социология. Статистика",
                "keywords": ["демография", "социология", "статистика"]
            },
            "32": {
                "description": "Политика",
                "keywords": ["политика"]
            },
            "33": {
                "description": "Экономика. Экономические науки",
                "keywords": ["экономика", "экономические науки"]
            },
            "34": {
                "description": "Право. Юридические науки",
                "keywords": ["право", "юридические науки"]
            },
            "35": {
                "description": "Государственное административное управление. Военное дело",
                "keywords": ["государственное управление", "военное дело"]
            },
            "36": {
                "description": "Обеспечение духовных и материальных жизненных потребностей. Социальное обеспечение. Социальная помощь. Обеспечение жильем. Страхование",
                "keywords": ["социальное обеспечение", "социальная помощь", "страхование"]
            },
            "37": {
                "description": "Воспитание. Обучение. Образование",
                "keywords": ["воспитание", "обучение", "образование"]
            },
            "38": {
                "description": "Исключено [1995]",
                "keywords": []
            },
            "39": {
                "description": "Этнография. Этнология. Нравы. Обычаи. Образ жизни. Фольклор",
                "keywords": ["этнография", "этнология", "фольклор"]
            }
        }
    },
    '5': {
        "description": "Математика и естественные науки",
        "keywords": ["математика", "естественные науки", "физика", "химия", "биология", "геология", "наука"],
        "subcategories": {
                    "50": {
                        "description": "Общие вопросы математических и естественных наук",
                        "keywords": []
                    },
                    "51": {
                        "description": "Математика",
                        "keywords": ["математика"]
                    },
                    "52": {
                        "description": "Астрономия. Астрофизика. Исследование космического пространства. Геодезия",
                        "keywords": ["астрономия", "астрофизика", "космос", "геодезия"]
                    },
                    "53": {
                        "description": "Физика",
                        "keywords": ["физика"]
                    },
                    "54": {
                        "description": "Химия. Кристаллография. Минералогия",
                        "keywords": ["химия", "кристаллография", "минералогия"]
                    },
                    "55": {
                        "description": "Науки о земле. Геологические науки",
                        "keywords": ["науки о земле", "геология"]
                    },
                    "56": {
                        "description": "Палеонтология",
                        "keywords": ["палеонтология"]
                    },
                    "57": {
                        "description": "Биологические науки в целом",
                        "keywords": ["биология"]
                    },
                    "58": {
                        "description": "Ботаника",
                        "keywords": ["ботаника"]
                    },
                    "59": {
                        "description": "Зоология",
                        "keywords": ["зоология"]
                    }
                }
    },
    '6': {
        "description": "Прикладные науки. Медицина. Технология",
        "keywords": ["медицина", "технология", "инженерия", "прикладные науки", "технологии", "лечебное дело"],
        "subcategories": {
                    "60": {
                        "description": "Биотехнология",
                        "keywords": ["биотехнология"]
                    },
                    "61": {
                        "description": "Медицинские науки",
                        "keywords": ["медицина", "медицинские науки"]
                    },
                    "62": {
                        "description": "ИНЖЕНЕРНОЕ ДЕЛО. ТЕХНИКА В ЦЕЛОМ",
                        "keywords": ["инженерное дело", "техника"]
                    },
                    "63": {
                        "description": "Сельское хозяйство. Лесное хозяйство. Охота. Рыбное хозяйство",
                        "keywords": ["сельское хозяйство", "лесное хозяйство", "охота", "рыбное хозяйство"]
                    },
                    "64": {
                        "description": "Домашнее хозяйство. Домоводство. Коммунально-бытовое хозяйство",
                        "keywords": ["домашнее хозяйство", "домоводство", "коммунально-бытовое хозяйство"]
                    },
                    "65": {
                        "description": "Телекоммуникации. Транспорт. Бухгалтерия. Организация производства. Связи с общественностью",
                        "keywords": ["телекоммуникации", "транспорт", "бухгалтерия", "организация производства", "связи с общественностью"]
                    },
                    "66": {
                        "description": "Химическая технология. Химическая промышленность. Пищевая промышленность. Металлургия. Родственные отрасли",
                        "keywords": ["химическая технология", "химическая промышленность", "пищевая промышленность", "металлургия"]
                    },
                    "67": {
                        "description": "Различные отрасли промышленности и ремесел. Производство изделий из различных материалов",
                        "keywords": ["промышленность", "ремесла", "производство изделий"]
                    },
                    "68": {
                        "description": "Отрасли промышленности и ремесла для изготовления и обработки различных изделий",
                        "keywords": ["отрасли промышленности", "обработка изделий"]
                    },
                    "69": {
                        "description": "Строительство. Строительные материалы. Строительно-монтажные работы",
                        "keywords": ["строительство", "строительные материалы", "строительно-монтажные работы"]
                    }
                }
    },
    '7': {
        "description": "Искусство. Развлечения. Зрелища. Спорт",
        "keywords": ["искусство", "развлечения", "театр", "кино", "спорт", "зрелища", "культура"],
        "subcategories": {
                    "7.0": {
                        "description": "Общие вопросы искусства и развлечений",
                        "keywords": []
                    },
                    "71": {
                        "description": "Планировка. Районная и городская планировка. Планировка в масштабе страны. Ландшафтная и садово-парковая архитектура",
                        "keywords": ["планировка", "городская планировка", "ландшафтная архитектура", "садово-парковая архитектура"]
                    },
                    "72": {
                        "description": "Архитектура",
                        "keywords": ["архитектура"]
                    },
                    "73": {
                        "description": "Пластические искусства",
                        "keywords": ["пластические искусства"]
                    },
                    "74": {
                        "description": "Рисование и черчение. Дизайн. Декоративно-прикладное искусство и художественные промыслы",
                        "keywords": ["рисование", "черчение", "дизайн", "декоративно-прикладное искусство"]
                    },
                    "75": {
                        "description": "Живопись",
                        "keywords": ["живопись"]
                    },
                    "76": {
                        "description": "Графические искусства. Графика. Гравюра",
                        "keywords": ["графические искусства", "графика", "гравюра"]
                    },
                    "77": {
                        "description": "Фотография и подобные процессы",
                        "keywords": ["фотография"]
                    },
                    "78": {
                        "description": "Музыка",
                        "keywords": ["музыка"]
                    },
                    "79": {
                        "description": "Развлечения. Зрелища. Игры. Спорт",
                        "keywords": ["развлечения", "зрелища", "игры", "спорт"]
                    }
                }
    },
    '8': {
        "description": "Язык. Языкознание. Лингвистика. Литература",
        "keywords": ["язык", "лингвистика", "литература", "грамматика", "языкознание"],
        "subcategories": {
                    "80": {
                        "description": "Общие вопросы лингвистики, литературы и филологии",
                        "keywords": []
                    },
                    "81": {
                        "description": "Языкознание и языки. Лингвистика",
                        "keywords": ["языкознание", "лингвистика", "языки"]
                    },
                    "82": {
                        "description": "Литература. Литературоведение",
                        "keywords": ["литература", "литературоведение"]
                    },
                    "88": {
                        "description": "Дополнительные вопросы",
                        "keywords": []
                    }
                }
    },
    '9': {
        "description": "География. Биографии. История",
        "keywords": ["география", "биографии", "история", "геология", "карты", "путешествия"],
        "subcategories": {
                    "90": {
                        "description": "Общие вопросы географии, биографий и истории",
                        "keywords": []
                    },
                    "91": {
                        "description": "География. Географические исследования Земли и отдельных стран. Путешествия. Региональная география",
                        "keywords": ["география", "географические исследования", "путешествия", "региональная география"]
                    },
                    "92": {
                        "description": "Дополнительные вопросы",
                        "keywords": []
                    },
                    "93": {
                        "description": "История",
                        "keywords": ["история"]
                    },
                    "94": {
                        "description": "Всеобщая история",
                        "keywords": ["всеобщая история"]
                    }
                }
    }

}


from collections import defaultdict

def classify_text_by_udc(text, keywords, key_phrases, tokenizer, model):
    """
    Классифицирует текст по разделам УДК на основе совпадений ключевых слов и модели.

    :param text: текст для классификации
    :param keywords: список ключевых слов
    :param key_phrases: список ключевых фраз
    :param tokenizer: токенайзер модели Hugging Face
    :param model: модель Hugging Face для классификации
    :return: строка подходящих разделов УДК в формате 'код:код:...' и их описания
    """
    udc_matches = defaultdict(int)
    udc_descriptions = {}

    # Проверка ключевых слов
    def match_keywords(udc_data):
        matched_keywords = []
        for keyword in udc_data['keywords']:
            if keyword in keywords:
                matched_keywords.append(keyword)
        for sub_udc_code, sub_udc_data in udc_data.get('subcategories', {}).items():
            matched_keywords.extend(match_keywords(sub_udc_data))
        return matched_keywords

    for udc_code, udc_data in udc_tree.items():
        matched_keywords = match_keywords(udc_data)
        if matched_keywords:
            udc_matches[udc_code] += len(matched_keywords)
            udc_descriptions[udc_code] = udc_data['description']

    # Модель классификации
    inputs = tokenizer(text, return_tensors="pt", truncation=True, max_length=512)
    outputs = model(**inputs)
    probabilities = outputs.logits.softmax(dim=1)[0]

    # Выбор наибольшего совпадения по УДК-классам
    sorted_codes = sorted(udc_matches.items(), key=lambda item: item[1], reverse=True)

    if sorted_codes:
        codes_output = ":".join(code for code, _ in sorted_codes)
        descriptions_output = ": ".join(udc_descriptions[code] for code, _ in sorted_codes)
        return codes_output, descriptions_output
    else:
        return "", ""


# Пример использования функции классификации
"""if __name__ == "__main__":
    example_text = "Наука и технологии в современном мире имеют огромное значение для общества."
    classified_udc, descriptions = classify_text_by_udc(example_text)

    print(f"Соответствующие УДК: {classified_udc}")
    print(f"Описание: {descriptions}")"""
